### This is a short introduction to pandas, geared mainly for new users. You can see more complex recipes in the [Cookbook](https://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Object Creation
See the [Data Structure Intro section](Data Structure Intro section). Creating a Series by passing a list of values, letting pandas create a default integer index:

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creating a [DataFrame](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html#pandas.DataFrame) by passing a numpy array, with a datetime index and labeled columns:

In [3]:
dates = pd.date_range('20141101', periods=6)
dates

DatetimeIndex(['2014-11-01', '2014-11-02', '2014-11-03', '2014-11-04',
               '2014-11-05', '2014-11-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns=['one','two','three','four'])
df

                 one       two     three      four
2014-11-01  0.014021  0.010841  1.061724 -0.556193
2014-11-02 -0.057772  1.326519 -0.219752 -0.989738
2014-11-03  1.394274  0.242951  1.783892  0.837710
2014-11-04 -1.928383 -0.513450 -0.735640 -0.521723
2014-11-05 -1.031397  1.580208 -0.910035  0.004658
2014-11-06  1.794758 -1.065106 -0.290761  0.679070

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [5]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })
   ....: 
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Having specific [dtypes](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes):

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object


# Viewing Data
See the [Basics section](https://pandas.pydata.org/pandas-docs/stable/basics.html#basics)
See the top & bottom rows of the frame

In [7]:
df.head()

                 one       two     three      four
2014-11-01  0.014021  0.010841  1.061724 -0.556193
2014-11-02 -0.057772  1.326519 -0.219752 -0.989738
2014-11-03  1.394274  0.242951  1.783892  0.837710
2014-11-04 -1.928383 -0.513450 -0.735640 -0.521723
2014-11-05 -1.031397  1.580208 -0.910035  0.004658

In [8]:
df.tail(3)

                 one       two     three      four
2014-11-04 -1.928383 -0.513450 -0.735640 -0.521723
2014-11-05 -1.031397  1.580208 -0.910035  0.004658
2014-11-06  1.794758 -1.065106 -0.290761  0.679070

Display the index, columns, and the underlying numpy data

In [9]:
df.index

DatetimeIndex(['2014-11-01', '2014-11-02', '2014-11-03', '2014-11-04',
               '2014-11-05', '2014-11-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [11]:
df.values #inorder to show numpy representation.....

array([[ 0.01402095,  0.0108408 ,  1.06172402, -0.55619328],
       [-0.05777192,  1.32651915, -0.21975204, -0.9897377 ],
       [ 1.3942744 ,  0.24295134,  1.78389225,  0.83771021],
       [-1.92838254, -0.51345011, -0.73564013, -0.52172282],
       [-1.03139664,  1.58020807, -0.91003478,  0.00465763],
       [ 1.79475827, -1.06510645, -0.29076126,  0.67907005]])

Describe shows a quick statistic summary of your data

In [12]:
df.describe() #25,50,75 denotes quartile ranges

            one       two     three      four
count  6.000000  6.000000  6.000000  6.000000
mean   0.030917  0.263660  0.114905 -0.091036
std    1.410347  1.029256  1.070745  0.731344
min   -1.928383 -1.065106 -0.910035 -0.989738
25%   -0.787990 -0.382377 -0.624420 -0.547576
50%   -0.021875  0.126896 -0.255257 -0.258533
75%    1.049211  1.055627  0.741355  0.510467
max    1.794758  1.580208  1.783892  0.837710

Transposing your data

In [13]:
df.T

       2014-11-01  2014-11-02  2014-11-03  2014-11-04  2014-11-05  2014-11-06
one      0.014021   -0.057772    1.394274   -1.928383   -1.031397    1.794758
two      0.010841    1.326519    0.242951   -0.513450    1.580208   -1.065106
three    1.061724   -0.219752    1.783892   -0.735640   -0.910035   -0.290761
four    -0.556193   -0.989738    0.837710   -0.521723    0.004658    0.679070

Sorting by an axis (In this case, sorting the columns in reverse alphabetical order):

In [14]:
df.sort_index(axis=1, ascending=False)

                 two     three       one      four
2014-11-01  0.010841  1.061724  0.014021 -0.556193
2014-11-02  1.326519 -0.219752 -0.057772 -0.989738
2014-11-03  0.242951  1.783892  1.394274  0.837710
2014-11-04 -0.513450 -0.735640 -1.928383 -0.521723
2014-11-05  1.580208 -0.910035 -1.031397  0.004658
2014-11-06 -1.065106 -0.290761  1.794758  0.679070

Sorting by values

In [15]:
df.sort_values(by='two')

                 one       two     three      four
2014-11-06  1.794758 -1.065106 -0.290761  0.679070
2014-11-04 -1.928383 -0.513450 -0.735640 -0.521723
2014-11-01  0.014021  0.010841  1.061724 -0.556193
2014-11-03  1.394274  0.242951  1.783892  0.837710
2014-11-02 -0.057772  1.326519 -0.219752 -0.989738
2014-11-05 -1.031397  1.580208 -0.910035  0.004658

# Selection

Note While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.
See the indexing documentation [Indexing and Selecting Data](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) and [MultiIndex / Advanced Indexing](https://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

## Getting

Selecting a single column, which yields a Series, equivalent to df.one

In [16]:
df['one']

2014-11-01    0.014021
2014-11-02   -0.057772
2014-11-03    1.394274
2014-11-04   -1.928383
2014-11-05   -1.031397
2014-11-06    1.794758
Freq: D, Name: one, dtype: float64

In [17]:
df.one

2014-11-01    0.014021
2014-11-02   -0.057772
2014-11-03    1.394274
2014-11-04   -1.928383
2014-11-05   -1.031397
2014-11-06    1.794758
Freq: D, Name: one, dtype: float64

Selecting via [], which slices the rows.

In [18]:
df[0:3]

                 one       two     three      four
2014-11-01  0.014021  0.010841  1.061724 -0.556193
2014-11-02 -0.057772  1.326519 -0.219752 -0.989738
2014-11-03  1.394274  0.242951  1.783892  0.837710

In [19]:
df['20141102':'20141104']

                 one       two     three      four
2014-11-02 -0.057772  1.326519 -0.219752 -0.989738
2014-11-03  1.394274  0.242951  1.783892  0.837710
2014-11-04 -1.928383 -0.513450 -0.735640 -0.521723

## Selecting by Label

See more in[ Selection by Label](https://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-label)

For getting a cross section using a label

In [20]:
df.loc[dates[0]]

one      0.014021
two      0.010841
three    1.061724
four    -0.556193
Name: 2014-11-01 00:00:00, dtype: float64

Selecting on a multi-axis by label

In [21]:
df.loc[:,['one','two']]

                 one       two
2014-11-01  0.014021  0.010841
2014-11-02 -0.057772  1.326519
2014-11-03  1.394274  0.242951
2014-11-04 -1.928383 -0.513450
2014-11-05 -1.031397  1.580208
2014-11-06  1.794758 -1.065106

Showing label slicing, both endpoints are included

In [22]:
df.loc['20141102':'20141104',['one','two']]

                 one       two
2014-11-02 -0.057772  1.326519
2014-11-03  1.394274  0.242951
2014-11-04 -1.928383 -0.513450

Reduction in the dimensions of the returned object

In [23]:
df.loc['20141102',['one','two']]

one   -0.057772
two    1.326519
Name: 2014-11-02 00:00:00, dtype: float64

For getting a scalar value

In [24]:
df.loc[dates[0],'one']

0.014020947122255947

For getting fast access to a scalar (equiv to the prior method)

In [25]:
df.at[dates[0],'one']

0.014020947122255947

## Selection by Position

See more in [Selection by Position](Selection by Position)

Select via the position of the passed integers

In [26]:
df.iloc[3]

one     -1.928383
two     -0.513450
three   -0.735640
four    -0.521723
Name: 2014-11-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

By lists of integer position locations, similar to the numpy/python style

In [27]:
df.iloc[[1,2,4],[0,2]]

                 one     three
2014-11-02 -0.057772 -0.219752
2014-11-03  1.394274  1.783892
2014-11-05 -1.031397 -0.910035

For slicing rows explicitly

In [28]:
df.iloc[1:3,:]

                 one       two     three      four
2014-11-02 -0.057772  1.326519 -0.219752 -0.989738
2014-11-03  1.394274  0.242951  1.783892  0.837710

For slicing columns explicitly

In [29]:
df.iloc[:,1:3]

                 two     three
2014-11-01  0.010841  1.061724
2014-11-02  1.326519 -0.219752
2014-11-03  0.242951  1.783892
2014-11-04 -0.513450 -0.735640
2014-11-05  1.580208 -0.910035
2014-11-06 -1.065106 -0.290761

For getting a value explicitly

In [30]:
df.iloc[1,1]

1.3265191463484014

For getting fast access to a scalar (equiv to the prior method)

In [31]:
df.iat[0,0]

0.014020947122255947

## Boolean Indexing
Using a single columns values to select data.

In [32]:
df[df.one > 0.5]

                 one       two     three     four
2014-11-03  1.394274  0.242951  1.783892  0.83771
2014-11-06  1.794758 -1.065106 -0.290761  0.67907

Selecting values from a DataFrame where a boolean condition is met.

In [33]:
df[df>0]

                 one       two     three      four
2014-11-01  0.014021  0.010841  1.061724       NaN
2014-11-02       NaN  1.326519       NaN       NaN
2014-11-03  1.394274  0.242951  1.783892  0.837710
2014-11-04       NaN       NaN       NaN       NaN
2014-11-05       NaN  1.580208       NaN  0.004658
2014-11-06  1.794758       NaN       NaN  0.679070

Using the isin method for filtering:

In [34]:
df2 = df.copy()
df2['five'] = ['one', 'one','two','three','four','three']
df2

                 one       two     three      four   five
2014-11-01  0.014021  0.010841  1.061724 -0.556193    one
2014-11-02 -0.057772  1.326519 -0.219752 -0.989738    one
2014-11-03  1.394274  0.242951  1.783892  0.837710    two
2014-11-04 -1.928383 -0.513450 -0.735640 -0.521723  three
2014-11-05 -1.031397  1.580208 -0.910035  0.004658   four
2014-11-06  1.794758 -1.065106 -0.290761  0.679070  three

In [35]:
df2[df2['five'].isin(['two','four'])]

                 one       two     three      four  five
2014-11-03  1.394274  0.242951  1.783892  0.837710   two
2014-11-05 -1.031397  1.580208 -0.910035  0.004658  four

# Getting Data In/Out
### CSV
[Writing to a csv file](https://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv).

In [36]:
df.to_csv('foo.csv')

In [37]:
pd.read_csv('foo.csv')

   Unnamed: 0       one       two     three      four
0  2014-11-01  0.014021  0.010841  1.061724 -0.556193
1  2014-11-02 -0.057772  1.326519 -0.219752 -0.989738
2  2014-11-03  1.394274  0.242951  1.783892  0.837710
3  2014-11-04 -1.928383 -0.513450 -0.735640 -0.521723
4  2014-11-05 -1.031397  1.580208 -0.910035  0.004658
5  2014-11-06  1.794758 -1.065106 -0.290761  0.679070

### HDF5
Reading and writing to [HDFStores](https://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5).

Writing to a HDF5 Store:

In [38]:
df.to_hdf('foo.h5','df')

Reading from a HDF5 Store:

In [39]:
pd.read_hdf('foo.h5','df')

                 one       two     three      four
2014-11-01  0.014021  0.010841  1.061724 -0.556193
2014-11-02 -0.057772  1.326519 -0.219752 -0.989738
2014-11-03  1.394274  0.242951  1.783892  0.837710
2014-11-04 -1.928383 -0.513450 -0.735640 -0.521723
2014-11-05 -1.031397  1.580208 -0.910035  0.004658
2014-11-06  1.794758 -1.065106 -0.290761  0.679070

### Excel
Reading and writing to [MS Excel](https://pandas.pydata.org/pandas-docs/stable/io.html#io-excel).

Writing to an excel file:

In [40]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

Reading from an excel file:

In [41]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

  Unnamed: 0       one       two     three      four
0 2014-11-01  0.014021  0.010841  1.061724 -0.556193
1 2014-11-02 -0.057772  1.326519 -0.219752 -0.989738
2 2014-11-03  1.394274  0.242951  1.783892  0.837710
3 2014-11-04 -1.928383 -0.513450 -0.735640 -0.521723
4 2014-11-05 -1.031397  1.580208 -0.910035  0.004658
5 2014-11-06  1.794758 -1.065106 -0.290761  0.679070